code-review/NRB_3471_3546/База_Стало/DataProcessors/ЗагрузкаСправочникаИННИОГРНЦБРФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаСправочникаИННИОГРНЦБРФ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальностиСправочника</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/DataProcessors/ЗагрузкаСправочникаИННИОГРНЦБРФ/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	Если Не ЗначениеЗаполнено(Объект.ДатаАктуальностиСправочника) Тогда
		Текст = "Не известна дата актуальности загружаемого справочника!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "ДатаАктуальностиСправочника", "Объект.ДатаАктуальностиСправочника");
		Возврат;
	КонецЕсли;
	Если Не ВозможнаЗагрузкаДанныхНаДату(Объект.ДатаАктуальностиСправочника) Тогда
		Возврат;
	КонецЕсли;
		
	СтрокаСостояния = "Заполнение регистра ...";
		
	РезультатДлительнойОперации = ЗагрузитьДанныеНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновлениеРегистраЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал = 2;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатДлительнойОперации, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	
	СтрокаСостояния = "";
	
	Элементы.ФормаЗагрузитьДанные.Доступность = Ложь;
	Если Не ЗначениеЗаполнено(Объект.ИмяФайла) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан файл для загрузки!");
		Возврат;
	КонецЕсли;
	
	Объект.ДатаАктуальностиСправочника = ДатаАктуальностиИзФайлаXML(Объект.ИмяФайла);
	СтрокаСостояния = "Чтение файла...";
	ПолучитьДанныеИзФайлаDBF(Объект.ИмяФайла);
	СтрокаСостояния = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВРегистр(Команда)
	
	ОткрытьФорму("РегистрСведений.ЮридическиеЛицаЦБРФ.Форма.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "Файл DBF (*.dbf)|*.dbf";
	Диалог.ПолноеИмяФайла = Объект.ИмяФайла;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		Объект.ИмяФайла = ВыбранныеФайлы[0];
	КонецЕсли;
	Элементы.ФормаПрочитатьФайл.Доступность = Не ПустаяСтрока(Объект.ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаПриИзменении(Элемент)
	Элементы.ФормаПрочитатьФайл.Доступность = Не ПустаяСтрока(Объект.ИмяФайла);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ДатаАктуальностиИзФайлаXML(ИмяФайлаDBF)
	ОписаниеОшибки = "";
	Дата = Неопределено;
	
	// Предполагаем, что в той же директории что и DBF должен находится файл nsi-info.xml
	ПозицияПоследнегоСлэша = СтрНайти(ИмяФайлаDBF , "\", НаправлениеПоиска.СКонца);
	ИмяФайлаXML = Лев(Объект.ИмяФайла, ПозицияПоследнегоСлэша) + "nsi-info.xml";
	ЧтениеXML = Новый ЧтениеXML;
	Попытка
		ЧтениеXML.ОткрытьФайл(ИмяФайлаXML);
	Исключение
		ОписаниеОшибки = "Не удалось открыть файл";
	КонецПопытки;
		
	Если ПустаяСтрока(ОписаниеОшибки) Тогда
		Дата = ДатаАктуальностиИзОбъектаЧтениеXML(ЧтениеXML, ОписаниеОшибки);
	КонецЕсли;
	
	Если Дата = Неопределено Тогда
		ТекстОшибки = "В файле " + ИмяФайлаDBF + " не удалось обнаружить информацию о дате актуальности данных ";
		Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
			ТекстОшибки = " по причине " + ОписаниеОшибки;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	Возврат Дата;
КонецФункции

&НаКлиенте
Функция ДатаАктуальностиИзОбъектаЧтениеXML(ЧтениеXML, ОписаниеОшибки)
	Дата = Неопределено;
	ИмяУзлаСДатойАктуальности = "date_version";
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = ИмяУзлаСДатойАктуальности Тогда
			ЧтениеXML.Прочитать();
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
				ДатаСтрокой = ЧтениеXML.Значение;
				Попытка
					Дата = СтроковыеФункцииКлиентСерверПереопределяемый.ПолучитьДатуПоСтрокеДДММГГ(ДатаСтрокой);
				Исключение
					ОписаниеОшибки = "Не удалось преобразовать значение узла " + ИмяУзлаСДатойАктуальности + " в дату";
					Дата = Неопределено;
				КонецПопытки;
			КонецЕсли;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Дата;
КонецФункции

&НаКлиенте
Процедура ПолучитьДанныеИзФайлаDBF(ИмяФайлаDBF)
	ДанныеИзDBF.Очистить();
	ЕстьКритическиеОшибки = Ложь;
	ФайлDBF = Новый XBase;
	Попытка
		ФайлDBF.ОткрытьФайл(ИмяФайлаDBF, , Истина);
		ФайлDBF.Кодировка = КодировкаXBase.OEM;
		ФайлDBF.Первая();
	Исключение
		// XBase дает очень невнятные сообщения об ошибках, поэтому заменяем на свое.
		ТекстОшибки = "Не удалось открыть файл " + Объект.ИмяФайла;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ЕстьКритическиеОшибки = Истина;
	КонецПопытки;

	Если Не ЕстьКритическиеОшибки Тогда
		Счетчик = 0;
		Пока Не ФайлDBF.ВКонце() Цикл
			Счетчик = Счетчик + 1;
			СтрокаКоллекции = ДанныеИзDBF.Добавить();
			СтрокаКоллекции.INN = СокрП(ФайлDBF.INN);
			СтрокаКоллекции.OPF = СокрП(ФайлDBF.OPF);
			СтрокаКоллекции.OGRN = СокрП(ФайлDBF.OGRN);
			СтрокаКоллекции.NAIM = СокрП(ФайлDBF.NAIM);
			СтрокаКоллекции.PNAIM = СокрП(ФайлDBF.PNAIM);
			СтрокаКоллекции.НомерСтроки = Счетчик;
			ФайлDBF.Следующая();
		КонецЦикла;
		Элементы.ФормаЗагрузитьДанные.Доступность = Истина;
	КонецЕсли;
	
	ФайлDBF.ЗакрытьФайл();	// обязательно закрываем файл, после прекращения работы
КонецПроцедуры

&НаСервере
Функция ЗагрузитьДанныеНаСервере()
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка данных в РС ""Юридические лица ЦБ РФ""'");
	
	РезультатДлительнойОперации = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполненияВФоне,
		"Обработка.ЗагрузкаСправочникаИННИОГРНЦБРФ.МодульОбъекта.ЗагрузитьДанныеЦБРФ",
		ДанныеИзDBF.Выгрузить(), Объект.ДатаАктуальностиСправочника, Объект.ИмяФайла);
	
	Возврат РезультатДлительнойОперации;
	
КонецФункции

&НаКлиенте
Процедура ОбновлениеРегистраЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.ПодробноеПредставлениеОшибки;
	КонецЕсли;
	
	СтрокаСостояния = "";
	
	ОписаниеРезультатаЗагрузки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеРезультатаЗагрузки);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ВозможнаЗагрузкаДанныхНаДату(ДатаАктуальности)
	ТекстОшибки = "";
	ВозможнаЗагрузка = РегистрыСведений.ЮридическиеЛицаЦБРФ.ВозможнаЗагрузкаДанныхНаДату(ДатаАктуальности, ТекстОшибки);
	Если Не ВозможнаЗагрузка Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	Возврат ВозможнаЗагрузка;
КонецФункции

#КонецОбласти
